ИС_СПОРТ_2022/src/Catalogs/Сборные/Сборные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сборные</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РангСборной</name>
    <type>
      <types>CatalogRef.РангиСборных</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Catalog>

ИС_СПОРТ_2022/src/Catalogs/Сборные/ObjectModule.bsl
#Область ОбработчикиСобытий

// {Рарус adilas #18123 -Сборные 2021.07.29
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
         Возврат;
    КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сборные.Представление КАК Сборная,
		|	Сборные.РангСборной.Представление КАК РангСборной,
		|	Сборные.Владелец.Представление КАК Организация
		|ИЗ
		|	Справочник.Сборные КАК Сборные
		|ГДЕ
		|	Сборные.Наименование = &Наименование
		|	И Сборные.Владелец = &Владелец
		|	И Сборные.РангСборной = &РангСборной";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("РангСборной", РангСборной);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Cборная с указанным наименованием, и рангом уже существует в учреждении'"));  
	
	КонецЕсли;
	
КонецПроцедуры
// }Рарус adilas #18123 -Сборные 2021.07.29

#КонецОбласти
